In [3]:
#importing libraries
from sklearn.datasets import load_boston
import pandas as pd
import matplotlib.pyplot as plt
%matplotlib inline

In [7]:
ng_price = pd.read_csv("datasets/NaturalGasPrice.csv")
co_price = pd.read_csv("datasets/CrudeOilPrice.csv")
ho_price = pd.read_csv("datasets/HeatingOilPrice.csv")
ng_production = pd.read_csv("datasets/NGProduction.csv")
ng_consumption = pd.read_csv("datasets/NGConsumption.csv")

In [8]:
ng_price.head()

         Date   High   Low  Open  Close   Volume  Adj Close
0  2000-08-30  4.815  4.63  4.65  4.805  34954.0      4.805
1  2000-08-31  4.870  4.74  4.82  4.780  25787.0      4.780
2  2000-09-01  4.860  4.75  4.75  4.835    113.0      4.835
3  2000-09-05  4.975  4.84  4.85  4.960  26096.0      4.960
4  2000-09-06  5.110  4.96  4.99  5.065  32764.0      5.065

In [22]:
ng_price["Date"][0]

'2000-08-30'

In [26]:
ng_price[ng_price["Date"] == "2001-01-02"].index.values

array([84])

In [28]:
ng_price["Date"][83]

'2000-12-29'

In [9]:
co_price.head()

         Date       High        Low       Open      Close   Volume  Adj Close
0  2000-08-23  32.799999  31.950001  31.950001  32.049999  79385.0  32.049999
1  2000-08-24  32.240002  31.400000  31.900000  31.629999  72978.0  31.629999
2  2000-08-25  32.099998  31.320000  31.700001  32.049999  44601.0  32.049999
3  2000-08-28  32.919998  31.860001  32.040001  32.869999  46770.0  32.869999
4  2000-08-29  33.029999  32.560001  32.820000  32.720001  49131.0  32.720001

In [10]:
ho_price.head()

         Date   High     Low   Open   Close   Volume  Adj Close
0  2000-09-01  0.991  0.9705  0.985  0.9764  14679.0     0.9764
1  2000-09-05  0.998  0.9750  0.995  0.9797  17365.0     0.9797
2  2000-09-06  1.000  0.9810  0.985  0.9966  18879.0     0.9966
3  2000-09-07  1.030  0.9880  0.990  1.0295  23851.0     1.0295
4  2000-09-08  1.020  0.9910  1.012  0.9949  23189.0     0.9949

In [16]:
ng_production.tail()

        Month  U.S. Natural Gas Marketed Production  Million Cubic Feet
582  May 1973                                            1898000
583  Apr 1973                                            1814000
584  Mar 1973                                            1907000
585  Feb 1973                                            1962000
586  Jan 1973                                            1948000

In [14]:
ng_consumption.tail()

        Month  U.S. Natural Gas Total Consumption  Million Cubic Feet
246  May 2001                                            1522382
247  Apr 2001                                            1807170
248  Mar 2001                                            2246633
249  Feb 2001                                            2309464
250  Jan 2001                                            2676998